# YOLOv8n + CBAM + P2 small object detection head (4-scale detection)
nc: 10
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1 - P2/4
  - [-1, 3, C2f_CBAM, [128, True]]      # 2 + CBAM  (P2 features)
  - [-1, 1, Conv, [256, 3, 2]]          # 3 - P3/8
  - [-1, 6, C2f_CBAM, [256, True]]      # 4 + CBAM  (P3 features)
  - [-1, 1, Conv, [512, 3, 2]]          # 5 - P4/16
  - [-1, 6, C2f_CBAM, [512, True]]      # 6 + CBAM  (P4 features)
  - [-1, 1, Conv, [1024, 3, 2]]         # 7 - P5/32
  - [-1, 3, C2f_CBAM, [1024, True]]     # 8 + CBAM
  - [-1, 1, SPPF, [1024, 5]]            # 9

head:
  # Top-down: P5 -> P4 -> P3 -> P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]                   # 11 cat P4
  - [-1, 3, C2f, [512]]                          # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]                   # 14 cat P3
  - [-1, 3, C2f, [256]]                          # 15 - P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16  NEW: up to P2
  - [[-1, 2], 1, Concat, [1]]                   # 17 cat P2
  - [-1, 3, C2f, [128]]                          # 18 - P2/4  NEW

  # Bottom-up: P2 -> P3 -> P4 -> P5
  - [-1, 1, Conv, [128, 3, 2]]                   # 19 down P2->P3
  - [[-1, 15], 1, Concat, [1]]                  # 20 cat P3
  - [-1, 3, C2f, [256]]                          # 21 - P3/8 (refined)

  - [-1, 1, Conv, [256, 3, 2]]                   # 22 down P3->P4
  - [[-1, 12], 1, Concat, [1]]                  # 23 cat P4
  - [-1, 3, C2f, [512]]                          # 24 - P4/16

  - [-1, 1, Conv, [512, 3, 2]]                   # 25 down P4->P5
  - [[-1, 9], 1, Concat, [1]]                   # 26 cat P5
  - [-1, 3, C2f, [1024]]                         # 27 - P5/32

  - [[18, 21, 24, 27], 1, Detect, [nc]]         # 28 Detect(P2,P3,P4,P5)
