# YOLOv8n + CBAM attention on backbone C2f blocks
nc: 10
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1 - P2/4
  - [-1, 3, C2f_CBAM, [128, True]]      # 2 + CBAM
  - [-1, 1, Conv, [256, 3, 2]]          # 3 - P3/8
  - [-1, 6, C2f_CBAM, [256, True]]      # 4 + CBAM
  - [-1, 1, Conv, [512, 3, 2]]          # 5 - P4/16
  - [-1, 6, C2f_CBAM, [512, True]]      # 6 + CBAM
  - [-1, 1, Conv, [1024, 3, 2]]         # 7 - P5/32
  - [-1, 3, C2f_CBAM, [1024, True]]     # 8 + CBAM
  - [-1, 1, SPPF, [1024, 5]]            # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]                   # 11 cat P4
  - [-1, 3, C2f, [512]]                          # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]                   # 14 cat P3
  - [-1, 3, C2f, [256]]                          # 15 - P3/8-out

  - [-1, 1, Conv, [256, 3, 2]]                   # 16
  - [[-1, 12], 1, Concat, [1]]                  # 17 cat P4
  - [-1, 3, C2f, [512]]                          # 18 - P4/16-out

  - [-1, 1, Conv, [512, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                   # 20 cat P5
  - [-1, 3, C2f, [1024]]                         # 21 - P5/32-out

  - [[15, 18, 21], 1, Detect, [nc]]             # 22 Detect(P3,P4,P5)
